knieriem/tinygo-stm32-svd/svd/stm32wba54.svd
Write access can be protected by GTZC_TZSC.TIM2SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. TIM2 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. TIM2 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <description>TIM3 stop in CPU debug

Write access can be protected by GTZC_TZSC.TIM3SEC.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. TIM3 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. TIM3 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>WWDG stop in CPU debug

Write access can be protected by GTZC_TZSC.WWDGSEC</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. WWDG continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. WWDG is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>IWDG stop in CPU debug

Write access can be protected by GTZC_TZSC.IWDGSEC.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. IWDG continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. IWDG is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_I2C1_STOP</name>
              <description>I2C1 SMBUS timeout stop in CPU debug

Write access can be protected by GTZC_TZSC.I2C1SEC.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. I2C1 SMBUS timeout continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. I2C1 SMBUS timeout is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_APB1HFZR</name>
          <displayName>DBGMCU_APB1HFZR</displayName>
          <description>DBGMCU APB1H peripheral freeze register</description>
          <addressOffset>0x00C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_LPTIM2_STOP</name>
              <description>LPTIM2 stop in CPU debug

Write access can be protected by GTZC_TZSC.LPTIM2SEC.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. LPTIM2 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. LPTIM2 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_APB2FZR</name>
          <displayName>DBGMCU_APB2FZR</displayName>
          <description>DBGMCU APB2 peripheral freeze register</description>
          <addressOffset>0x010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_TIM1_STOP</name>
              <description>TIM1 stop in CPU debug

Write access can be protected by GTZC_TZSC.TIM1SEC.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. TIM1 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. TIM1 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <description>TIM16 stop in CPU debug

Write access can be protected by GTZC_TZSC.TIM16SEC.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. TIM16 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. TIM16 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <description>TIM17 stop in CPU debug

Write access can be protected by GTZC_TZSC.TIM17SEC.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. TIM17 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. TIM17 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_APB7FZR</name>
          <displayName>DBGMCU_APB7FZR</displayName>
          <description>DBGMCU APB7 peripheral freeze register</description>
          <addressOffset>0x024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_I2C3_STOP</name>
              <description>I2C3 stop in CPU debug

Access can be protected by GTZC_TZSC.I2C3SEC.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. I2C3 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. I2C3 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_LPTIM1_STOP</name>
              <description>LPTIM1 stop in CPU debug

Access can be protected by GTZC_TZSC.LPTIM1SEC.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. LPTIM1 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. LPTIM1 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>RTC stop in CPU debug

Access can be protected by GTZC_TZSC.TIM17SEC.

Can only be accessed secure when one or more features in the RTC or TAMP is/are secure.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. RTC continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. RTC is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGMCU_AHB1FZR</name>
          <displayName>DBGMCU_AHB1FZR</displayName>
          <description>DBGMCU AHB1 peripheral freeze register</description>
          <addressOffset>0x028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBG_GPDMA1_CH0_STOP</name>
              <description>GPDMA 1 channel 0 stop in CPU debug

Write access can be protected by GPDMA_SECCFGR.SEC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Normal operation. GPDMA 1 channel 0 continues to operate while CPU is in debug mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop in debug. GPDMA 1 channel 0 is frozen while CPU is in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_GPDMA1_CH1_STOP</name>
              <description>GPDMA 1 channel 1 stop in CPU debug

