knieriem/tinygo-stm32-svd/svd/stm32wba54.svd
        <register>
          <name>GPIOB_SECCFGR</name>
          <displayName>GPIOB_SECCFGR</displayName>
          <description>GPIO port B secure configuration register</description>
          <addressOffset>0x030</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC0</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC1</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC2</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC3</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC4</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC5</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC6</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC7</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC8</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC9</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC10</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC11</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC12</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC13</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC14</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC15</name>
              <description>I/O pin of port secure bit enable y
These bits are written by software to enabled the security I/O port pin. 
Note that bit 10 is reserved on STM32WBA55xx devices.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The I/O pin is non-secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The I/O pin is secure. Refer to Table 112 for all corresponding secured bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
