knieriem/tinygo-stm32-svd/svd/stm32wba54.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>SEC_WWDG</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x50002C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>PTACONV</name>
      <description>PTA converter</description>
      <groupName>PTACONV</groupName>
      <baseAddress>0x48038000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTACONV_ACTCR</name>
          <displayName>PTACONV_ACTCR</displayName>
          <description>PTACONV active control register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TACTIVE</name>
              <description>PTA_ACTIVE setup time in us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTPOL</name>
              <description>PTA_ACTIVE polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TABORT</name>
              <description>PTA_ACTIVE delay to cease an ongoing transmission in us</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABORTDIS</name>
              <description>Disable PTA_ACTIVE deny to abort an ongoing transmission</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTACONV_PRICR</name>
          <displayName>PTACONV_PRICR</displayName>
          <description>PTACONV priority control register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPRIORITY</name>
              <description>Priority valid time in us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIPOL</name>
              <description>Priority polarity.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTACONV_CR</name>
          <displayName>PTACONV_CR</displayName>
          <description>PTACONV control register</description>
          <addressOffset>0x008</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXRXPOL</name>
              <description>PTA_STATUS transmit and receive polarity.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRANTPOL</name>
              <description>PTA_GRANT polarity.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
	</peripheral>
    <peripheral derivedFrom="PTACONV">
      <name>SEC_PTACONV</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x58038000</baseAddress>
    </peripheral>
    <peripheral>
      <name>DCB</name>
      <description>Debug Control Block</description>
      <groupName>DCB</groupName>
      <baseAddress>0xE000EE08</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSCSR</name>
          <displayName>DSCSR</displayName>
          <description>Debug Security Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDS</name>
              <description>Current domain Secure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
